# CriticalPathCollector Properties

---
The CriticalPathCollector type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
CriticalPathCollector Class
Autodesk.Revit.DB.Analysis Namespace